# Brewfile
# Install everything: brew bundle --file=Brewfile
# Check what's missing: brew bundle check --file=Brewfile

# CLI Essentials
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "yq"        # like jq but for YAML
brew "tree"
brew "fzf"
brew "ripgrep"
brew "fd"        # better find
brew "bat"       # better cat
brew "eza"       # better ls
brew "gh"        # GitHub CLI
brew "tldr"      # simplified man pages
brew "vim"

# Git
brew "git-delta" # better diffs

# Shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "direnv"    # per-directory environment variables
brew "watchman"  # file watcher (used by JS tooling)

# Version Managers
brew "fnm"         # Fast Node Manager
brew "rbenv"       # Ruby version manager
brew "ruby-build"  # rbenv plugin for installing Ruby versions

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"

# Docker
cask "docker"  # Docker Desktop

# Apps
cask "iterm2"
cask "brave-browser"
cask "rectangle"
cask "claude-code"
cask "visual-studio-code"
